app/Order.php

select * from `tables` where `tables`.`id` is null and `tables`.`id` is not null
---
    public function getTableassignedAttribute()
    {
        return $this->table()->with('restoarea')->get();

select `status`.*, `order_has_status`.`order_id` as `pivot_order_id`, `order_has_status`.`status_id` as `pivot_status_id`, `order_has_status`.`user_id` as `pivot_user_id`, `order_has_status`.`created_at` as `pivot_created_at`, `order_has_status`.`comment` as `pivot_comment` from `status` inner join `order_has_status` on `status`.`id` = `order_has_status`.`status_id` where `order_has_status`.`order_id` is null order by `order_has_status`.`id` desc limit 1
---
    public function getLastStatusAttribute()
    {
        return $this->belongsToMany(\App\Status::class, 'order_has_status', 'order_id', 'status_id')->withPivot('user_id', 'created_at', 'comment')->orderBy('order_has_status.id', 'DESC')->limit(1)->get();