app/Http/Controllers/FrontEndController.php

select * from `tables` where `restaurant_id` = 1
---
            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();