app/Http/Controllers/ItemsController.php

insert into `items` (`name`, `description`, `price`, `category_id`, `vat`, `image`, `updated_at`, `created_at`) values ('{\"en\":\"Test\"}', '{\"en\":\"Test\"}', '45', '102', 0, '203683b0-7bad-4713-aa6c-eb5cc140b4d9', '2021-12-27 15:05:21', '2021-12-27 15:05:21')
---
    public function store(Request $request)
    {
        $item = new Items;
        $item->name = strip_tags($request->item_name);
        $item->description = strip_tags($request->item_description);
        $item->price = strip_tags($request->item_price);
        $item->category_id = strip_tags($request->category_id);
        $defVat=0;
        $resto=$this->getRestaurant();
        if($resto){
            $defVat=$resto->getConfig('default_tax_value',0);
        }
        $item->vat=$defVat;

        if ($request->hasFile('item_image')) {
            $item->image = $this->saveImageVersions(
                $this->imagePath,
                $request->item_image,
                [
                    ['name'=>'large', 'w'=>590, 'h'=>400],
                    //['name'=>'thumbnail','w'=>300,'h'=>300],
                    ['name'=>'medium', 'w'=>295, 'h'=>200],
                    ['name'=>'thumbnail', 'w'=>200, 'h'=>200],
                ]
            );
        }
        $item->save();